In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv("taitanic.csv")

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df_1 = df[["Age", "Fare"]]
df_1.head()

    Age     Fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [5]:
df_1["Normalized_Age"] = (df_1["Age"] - df_1["Age"].min()) / (df_1["Age"].max() - df_1["Age"].min())

C:\Users\Hediye\AppData\Local\Temp\ipykernel_46216\2171076668.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_1["Normalized_Age"] = (df_1["Age"] - df_1["Age"].min()) / (df_1["Age"].max() - df_1["Age"].min())

In [6]:
print("Minimum", df_1["Normalized_Age"].min())
print("Maximum", df_1["Normalized_Age"].max())

Minimum 0.0
Maximum 1.0

In [7]:
df_1["Standardized_Age"] = (df_1["Age"] - df_1["Age"].mean()) / df_1["Age"].std()

C:\Users\Hediye\AppData\Local\Temp\ipykernel_46216\1920915409.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_1["Standardized_Age"] = (df_1["Age"] - df_1["Age"].mean()) / df_1["Age"].std()

In [8]:
df_1.head()

    Age     Fare  Normalized_Age  Standardized_Age
0  22.0   7.2500        0.271174         -0.530005
1  38.0  71.2833        0.472229          0.571430
2  26.0   7.9250        0.321438         -0.254646
3  35.0  53.1000        0.434531          0.364911
4  35.0   8.0500        0.434531          0.364911

In [9]:
print("Minimum", df_1["Standardized_Age"].min())
print("Maximum", df_1["Standardized_Age"].max())

Minimum -2.0155662426542023
Maximum 3.4626986259776564